eisup_2019_docmng_integration/src/Documents/абс_СдачаВАрендуОс/абс_СдачаВАрендуОс.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_СдачаВАрендуОс</name>
  <registerRecords>InformationRegister.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет</registerRecords>
  <registerRecords>InformationRegister.СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет</registerRecords>
  <registerRecords>InformationRegister.СобытияОСОрганизаций</registerRecords>
  <registerRecords>InformationRegister.СобытияОС</registerRecords>
  <registerRecords>InformationRegister.абс_ОсСданныеВАренду</registerRecords>
  <registerRecords>InformationRegister.СпособыОтраженияРасходовПоАмортизацииОС</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСдачиВАренду</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Арендатор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОжидаемаяДатаВозврата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Событие</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>СобытиеРегл</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособОтраженияРасходовПоАмортизации</name>
    <type>
      <types>CatalogRef.СпособыОтраженияРасходовПоАмортизации</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВозвратИзАренды</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОсновныеСредства</name>
    <attributes>
      <name>ОсновноеСредство</name>
      <type>
        <types>CatalogRef.ОсновныеСредства</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/абс_ОсСданныеВАренду/абс_ОсСданныеВАренду.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_ОсСданныеВАренду</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаСдачиВАренду</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОжидаемаяДатаВозврата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерДоговора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СобытиеОС</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОС</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Арендатор</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет/СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет</name>
  <comment>(Регл) Регистр, который показывает изменение направлений амортизации по бух. учету</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СпособыОтраженияРасходовПоАмортизации</name>
    <type>
      <types>CatalogRef.СпособыОтраженияРасходовПоАмортизации</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет/СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет</name>
  <comment>(Регл) Регистр, который показывает изменение направлений амортизации по налоговому учету</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СпособыОтраженияРасходовПоАмортизации</name>
    <comment>Направление начисления, для определения счета отнесения амортизации</comment>
    <type>
      <types>CatalogRef.СпособыОтраженияРасходовПоАмортизации</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/СпособыОтраженияРасходовПоАмортизацииОС/СпособыОтраженияРасходовПоАмортизацииОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СпособыОтраженияРасходовПоАмортизацииОС</name>
  <comment>(Упр) Регистр, который показывает изменение направлений амортизации по упр. учету</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СпособыОтраженияРасходовПоАмортизации</name>
    <type>
      <types>CatalogRef.СпособыОтраженияРасходовПоАмортизации</types>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/СобытияОС/СобытияОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СобытияОС</name>
  <comment>(Упр)  Регистр, который показывает события по упр. учету ОС. Данные вносятся только документами. Из этого регистра берется номер и название документа события.</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НазваниеДокумента</name>
    <comment>(Упр)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерДокумента</name>
    <comment>(Упр)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЗатрат</name>
    <comment>(Упр)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/СобытияОСОрганизаций/СобытияОСОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СобытияОСОрганизаций</name>
  <comment>(Регл) Регистр, который показывает события по регл. учету ОС. Данные вносятся только документами. Из этого регистра берется номер и название документа события.</comment>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>НазваниеДокумента</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>НомерДокумента</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>11</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЗатратБУ</name>
    <comment>(Регл)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЗатратНУ</name>
    <comment>(Регл)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЗатратУСН</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОсновноеСредство</name>
    <type>
      <types>CatalogRef.ОсновныеСредства</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>CatalogRef.СобытияОС</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абсПризнакиСобственностиОС/абсПризнакиСобственностиОС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абсПризнакиСобственностиОС</name>
  <enumValues>
    <name>ВСобственности</name>
  </enumValues>
  <enumValues>
    <name>ВАренде</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_СдачаВАрендуОс/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Сообщить("Проведение невозможно, не заполнен реквизит: Организация!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаСдачиВАренду) Тогда
		Сообщить("Проведение невозможно, не заполнен реквизит: ""Дата сдачи в аренду""!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(Арендатор) Тогда
		Сообщить("Проведение невозможно, не заполнен реквизит: Арендатор!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(НомерДоговора) Тогда
		Сообщить("Проведение невозможно, не заполнен реквизит: Номер договора!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Событие)ИЛИ Не ЗначениеЗаполнено(СобытиеРегл) Тогда
		Сообщить("Проведение невозможно, не заполнен реквизит: Событие!");
		Отказ = Истина;
		Возврат;
	КонецЕсли;

   
	//Формирование шапки документа	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	абс_СдачаВАрендуОс.Ссылка,
	|	абс_СдачаВАрендуОс.ВерсияДанных,
	|	абс_СдачаВАрендуОс.Номер,
	|	абс_СдачаВАрендуОс.Дата,
	|	абс_СдачаВАрендуОс.Организация,
	|	абс_СдачаВАрендуОс.ДатаСдачиВАренду,
	|	абс_СдачаВАрендуОс.Арендатор,
	|	абс_СдачаВАрендуОс.НомерДоговора,
	|	абс_СдачаВАрендуОс.ОжидаемаяДатаВозврата,
	|	абс_СдачаВАрендуОс.Событие,
	|	абс_СдачаВАрендуОс.СобытиеРегл,
	|	абс_СдачаВАрендуОс.СпособОтраженияРасходовПоАмортизации,
	|	абс_СдачаВАрендуОс.Комментарий
	|ИЗ
	|	Документ.абс_СдачаВАрендуОс КАК абс_СдачаВАрендуОс
	|ГДЕ
	|	абс_СдачаВАрендуОс.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ТЗШапки = Запрос.Выполнить().Выгрузить();
	СтруктураШапкиДокумента =ТЗШапки[0]; 
	//Данные из ТЧ ОсновныеСредства. 
	ТабОС = ОсновныеСредства.выгрузить();
	
	Если Не Отказ Тогда
		//Создать движения по регистрам.
		ДвиженияПоРегистрам(ТабОС, СтруктураШапкиДокумента);
	КонецЕсли;
	
	
	
КонецПроцедуры

Процедура ДвиженияПоРегистрам(ТабОС, СтруктураШапкиДокумента)
	//Движения по регистру 	РС «Способы по отражению расходов по амортизации (БУ)»
	ДвижениеПоРегиструСпособыОтраженияРасходовБух( ТабОС, СтруктураШапкиДокумента);
	
	//Движения по регистру 	РС «Способы по отражению расходов по амортизации (НУ)»
	ДвижениеПоРегиструСпособыОтраженияРасходовНал( ТабОС, СтруктураШапкиДокумента);
	
	//Движения по регистру 	РС «Способы по отражению расходов по амортизации (УПР.)»
	ДвижениеПоРегиструСпособыОтраженияРасходовУпр( ТабОС, СтруктураШапкиДокумента);
	
	//Движения по регистру 	РС События ОС
	ДвижениеПоРегиструСобытияОС( ТабОС, СтруктураШапкиДокумента);
	
	//Движения по регистру 	РС События ОС Организаций 
	ДвижениеПоРегиструСобытияОСОрганизаций(ТабОС, СтруктураШапкиДокумента);
	
	//Движения по регистру 	абс_ОсСданныеВАренду 
	ДвижениеПоРегиструОсСданныеВАренду(ТабОС, СтруктураШапкиДокумента);
	
	//Меняем признак собственности = в аренде
	МеняемПризнакСобственности(ТабОС);
	
КонецПроцедуры

Процедура ДвижениеПоРегиструОсСданныеВАренду(ТабОС, СтруктураШапкиДокумента)
	СобытиеОС     = Движения.абс_ОсСданныеВАренду;
	Для каждого Строка ИЗ ТабОС Цикл
		СтрокаДвижения = СобытиеОС.Добавить();
		СтрокаДвижения.Период = Дата;
		СтрокаДвижения.Регистратор = Ссылка;
		СтрокаДвижения.Организация = СтруктураШапкиДокумента.Организация;
		СтрокаДвижения.ОС = Строка.ОсновноеСредство;
		СтрокаДвижения.СобытиеОС = СтруктураШапкиДокумента.СобытиеРегл;
		СтрокаДвижения.Арендатор = СтруктураШапкиДокумента.Арендатор;
		СтрокаДвижения.ДатаСдачиВАренду = СтруктураШапкиДокумента.ДатаСдачиВАренду;
		СтрокаДвижения.ОжидаемаяДатаВозврата = СтруктураШапкиДокумента.ОжидаемаяДатаВозврата;
		СтрокаДвижения.НомерДоговора = СтруктураШапкиДокумента.НомерДоговора;
	КонецЦикла;
	СобытиеОС.Записать();
КонецПроцедуры




// Процедура формирования движений по регистру Сопособы отражения расходов по амортизации ОС бух.
//
Процедура ДвижениеПоРегиструСпособыОтраженияРасходовБух( ТабОС, СтруктураШапкиДокумента)
	
	НаборДвижений   = Движения.СпособыОтраженияРасходовПоАмортизацииОСБухгалтерскийУчет;
	
	Если ЗначениеЗаполнено(СтруктураШапкиДокумента.СпособОтраженияРасходовПоАмортизации) Тогда
		
		Для Каждого СтрокаОС Из ТабОС Цикл
			
			
			НоваяСтрока = НаборДвижений.Добавить();
			НоваяСтрока.Период           = Дата;
			НоваяСтрока.Активность       = Истина;
			НоваяСтрока.ОсновноеСредство = СтрокаОС.ОсновноеСредство;
			НоваяСтрока.Организация      = СтруктураШапкиДокумента.Организация;
			НоваяСтрока.СпособыОтраженияРасходовПоАмортизации = СтруктураШапкиДокумента.СпособОтраженияРасходовПоАмортизации;
			
			
		КонецЦикла;
	КонецЕсли;
	
	НаборДвижений.Записать();	
КонецПроцедуры // ДвижениеПоРегиструСпособыОтраженияРасходовБух()


// Процедура формирования движений по регистру Сопособы отражения расходов по амортизации ОС нал.
//
Процедура ДвижениеПоРегиструСпособыОтраженияРасходовНал( ТабОС, СтруктураШапкиДокумента)
	
	НаборДвижений   = Движения.СпособыОтраженияРасходовПоАмортизацииОСНалоговыйУчет;
	
	Если ЗначениеЗаполнено(СтруктураШапкиДокумента.СпособОтраженияРасходовПоАмортизации) Тогда
		Для Каждого СтрокаОС Из ТабОС Цикл
			
			НоваяСтрока = НаборДвижений.Добавить();
			НоваяСтрока.Период           = Дата;
			НоваяСтрока.Активность       = Истина;
			НоваяСтрока.ОсновноеСредство = СтрокаОС.ОсновноеСредство;
			НоваяСтрока.Организация      = СтруктураШапкиДокумента.Организация;
			НоваяСтрока.СпособыОтраженияРасходовПоАмортизации = СтруктураШапкиДокумента.СпособОтраженияРасходовПоАмортизации;
			
		КонецЦикла;
	КонецЕсли;
	
	НаборДвижений.Записать();
	
КонецПроцедуры // ДвижениеПоРегиструСпособыОтраженияРасходовНал()

////////

// Процедура формирования движений по регистру Сопособы отражения расходов по амортизации ОС.
//
Процедура ДвижениеПоРегиструСпособыОтраженияРасходовУпр( ТабОС, СтруктураШапкиДокумента)
	
	НаборДвижений   = Движения.СпособыОтраженияРасходовПоАмортизацииОС;
	
	Если ЗначениеЗаполнено(СтруктураШапкиДокумента.СпособОтраженияРасходовПоАмортизации) Тогда
		Для Каждого СтрокаОС Из ТабОС Цикл
			
			
			НоваяСтрока = НаборДвижений.Добавить();
			НоваяСтрока.Период           = Дата;
			НоваяСтрока.Активность       = Истина;
			НоваяСтрока.ОсновноеСредство = СтрокаОС.ОсновноеСредство;
			НоваяСтрока.СпособыОтраженияРасходовПоАмортизации = СтруктураШапкиДокумента.СпособОтраженияРасходовПоАмортизации;
			
		КонецЦикла;
	КонецЕсли;
	
	НаборДвижений.Записать();
	
КонецПроцедуры // ДвижениеПоРегиструСпособыОтраженияРасходовУпр()


Процедура ДвижениеПоРегиструСобытияОС( ТабОС, СтруктураШапкиДокумента)
	
	СобытиеОС     = Движения.СобытияОС;
	
	Для каждого СтрокаТЧ Из ТабОС Цикл
		
		Движение = СобытиеОС.Добавить();
		Движение.Период            = Дата;
		Движение.ОсновноеСредство  = СтрокаТЧ.ОсновноеСредство;
		Движение.Событие           = СтруктураШапкиДокумента.Событие;
		Движение.НазваниеДокумента = Метаданные().Представление();
		Движение.НомерДокумента    = СтруктураШапкиДокумента.Номер;
		
	КонецЦикла;
	СобытиеОС.Записать();
	
	
КонецПроцедуры


Процедура ДвижениеПоРегиструСобытияОСОрганизаций(ТабОС, СтруктураШапкиДокумента)
	
	СобытиеОСБух  = Движения.СобытияОСОрганизаций;
	
	Для каждого СтрокаТЧ Из ТабОС Цикл
		
		Движение = СобытиеОСБух.Добавить();
		
		Движение.Период             = Дата;
		Движение.ОсновноеСредство   = СтрокаТЧ.ОсновноеСредство;
		Движение.Организация        = СтруктураШапкиДокумента.Организация;
		Движение.Событие            = СтруктураШапкиДокумента.СобытиеРегл;
		Движение.НазваниеДокумента 	= Метаданные().Представление();
		Движение.НомерДокумента    	= Номер;
		
	КонецЦикла;
	СобытиеОСБух.Записать();
	
КонецПроцедуры


Процедура МеняемПризнакСобственности(ТабОС)
	
	Для каждого Строка ИЗ ТабОС Цикл
		
		ОбъектОС = Строка.ОсновноеСредство.ПолучитьОбъект();
		Если Не ВозвратИзАренды Тогда
			ОбъектОС.ПризнакСобственности = Перечисления.абсПризнакиСобственностиОС.ВАренде;
		Иначе 
			ОбъектОС.ПризнакСобственности = Перечисления.абсПризнакиСобственностиОС.ВСобственности;
		КонецЕсли;
		ОбъектОС.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
